[
    {
        "id": 1001,
        "name": "Spicy Chicken With Couscous",
        "imageName": "https://blogscdn.thehut.net/app/uploads/sites/478/2019/12/Spicy-Chicken-ARTICLE_1577793747.jpg",
        "description": "This super-tasty macro-balanced meal is perfect for nailing that meal prep. Bursting with flavour, it’s a simple way to liven up your routine from plain old chicken and rice.",
        "ingredients": "1 tbsp curry paste, 1 tbsp mango chutney, 1/2 tsp turmeric, 1 serving salt (to taste), 50 ml olive oil, 4 chicken breasts, 300 g couscous, 350 ml vegetable stock",
        "directions": "To make a marinade for your chicken, add the curry paste, chutney, turmeric, salt and olive oil to a bowl and mix it well. Cut each chicken breast in half before adding to the marinade. Stir well until all of the chicken is covered. Leave the chicken aside for at least 20 minutes — ideally in the fridge overnight. Heat a grill pan over medium heat and lay out your chicken pieces. Grill the chicken pieces for 5-6 minutes on each side, or until golden and slightly charred. Meanwhile, place the couscous in a big bowl and carefully pour in the boiling vegetable stock. Cover the bowl with a lid and leave to the couscous to soak for around 5 minutes. Fluff your couscous with a fork and add any extras you want. Pomegranate seeds are great for a colour and flavour. Divide your couscous into 4 containers before topping with two pieces of marinated chicken. Finish the dish with a sprinkle of coriander.",
        "category": "Lunch",
        "availableOn": "Monday",
        "datePublished": "08-03-2019",
        "url": "https://www.myprotein.com/thezone/recipe/spicy-chicken-with-couscous-macro-balanced-meals/"
    },
    {
        "id": 1002,
        "name": "Speedy Harissa Chicken & Tabbouleh",
        "imageName": "https://blogscdn.thehut.net/wp-content/uploads/sites/478/2017/11/13132628/MYP-Vegan-Harssa-Chicken-Meal-Prep-1800x1200.jpg",
        "description": "Liven up your chicken meal prep with this quick harissa chicken and tabbouleh – packed with protein and healthy carbohydrates.",
        "ingredients": "50 g harissa paste, 1 tsp extra virgin olive oil, 1 pinch seal salt, 3 x chicken breast (try skin-on for extra flavour), 180 g bulgar wheat or couscous (dry weight), 40 g parsley (stems and leaves), 20 g mint leaves, 6-8 x spring onions, 1/2 a cucumber, 4 x tomatoes, 6 tbsp Greek yoghurt, 1/2 a lemon (juice and zest), 1 clove of garlic (minced), 1 pinch of sea salt, 1 handful of pomegranate seeds (optional)",
        "directions": "For the chicken: Preheat the oven to 190°C. In a small bowl, mix the harissa paste, olive oil, and a pinch of salt. Score the tops of the chicken breasts with a sharp knife, then rub the harissa mixture over the chicken breasts and into the score lines. Whilst waiting, make the tabbouleh. Cook bulgar wheat or couscous according to the directions on the back of the pack. Once cooked, drain, pour into a large mixing bowl and separate the grains with a fork. Allow to cool. Finely chop the parsley, mint leaves, spring onions, cucumber and For the dressing: Simply combine the Greek yoghurt, lemon juice and zest, minced garlic, and sea salt in a bowl. Once all components are ready, divide amongst three Tupperware containers. Allow to cool, then refrigerate and store for up to 3 days.",
        "category": "Lunch",
        "availableOn": "Tuesday",
        "datePublished": "22-05-2020",
        "url": "https://www.myprotein.com/thezone/recipe/chicken-meal-prep-recipes-harissa-chicken/"
    },
    {
        "id": 1003,
        "name": "Buffalo Chicken Pasta Salad",
        "imageName": "https://blogscdn.thehut.net/app/uploads/sites/478/2021/03/Buffalo-chicken-1800x1200-minopt_blog_1573554985_1653894195.jpg",
        "description": "This high-protein buffalo chicken pasta salad will change your chicken meal prep game forever. Trust us – buffalo sauce makes everything better.",
        "ingredients": "For the pasta: 160g cooked pasta, 3 breasts cooked chicken, 2 stalks celery, Handful cherry tomatoes, 1 yellow pepper, 2 tbsp. reduced-fat ranch dressing, Large handful mixed leaves. For the buffalo sauce: 175ml peri-peri sauce, ½ tsp. garlic powder, 4 tbsp. reduced-fat butter or margarine, Pinch salt",
        "directions": "Place a saucepan over a medium heat and add the peri-peri sauce and garlic powder. Cook for 2 minutes, then add butter and salt and cook for a further 5 minutes, stirring occasionally. Remove from the heat and allow to cool for a few minutes. Chop celery, tomatoes and pepper into bite-size pieces, and then shred the chicken using two forks. Place into a large mixing bowl with the cooked pasta. Pour over buffalo sauce and toss it through the pasta salad. Divide amongst 3 meal-prep containers and drizzle a little ranch dressing over each, and serve with a handful of mixed leaves or your favourite side salad. Refrigerate for up to 3 days and enjoy hot or cold.",
        "category": "Breakfast",
        "availableOn": "Monday",
        "datePublished": "17-01-2021",
        "url": "https://www.myprotein.com/thezone/recipe/buffalo-chicken-3-day-chicken-meal-prep/"
    },
    {
        "id": 1004,
        "name": "Asian Peanut Butter Sesame Chicken",
        "imageName": "https://blogscdn.thehut.net/app/uploads/sites/478/2021/03/Peanut-butter-chicken-1800-1200_1653894289.jpg",
        "description": "Try switching up your chicken meal prep for our Asian-inspired peanut butter chicken, at only 498kcal and a huge 40g protein per meal.",
        "ingredients": "For the chicken: 5 tbsp. Peanut Butter, 50ml orange juice, 3 tbsp. Sugar-Free Syrup (Maple Flavour), 3 tbsp. soy sauce, 1 thumb ginger (grated), 3 chicken breasts. For the salad: 2 cucumbers (spiralised or thinly sliced), 2 carrots (spiralised or thinly sliced). Salad dressing: 2 tbsp. Sugar-Free Syrup (Maple Flavour) or Maple Syrup, 4 tbsp. soy sauce, 2 tbsp. sesame oil (if you don’t have this, substitute for your preferred oil or go without to reduce fat content). Serve with: 30g (dry weight) brown/basmati rice per meal",
        "directions": "Preheat the oven to 200°C or 180°C for fan-assisted. Whisk peanut butter, 100ml hot water and orange juice together until smooth then add the syrup, soy sauce and ginger. Set aside. Season and sear the chicken breasts by frying on a high heat using a non-stick pan for 3 minutes on each side, then transfer to a casserole dish and thoroughly coat the chicken with the peanut butter sauce. Bake for 20 minutes. Whilst waiting, make the salad dressing by whisking the syrup, soy, sesame oil and seeds together, then combine with the spiralised cucumber and carrots. Once the chicken is cooked, place into meal prep boxes and serve with the salad and brown rice. Three days lunch prep sorted.",
        "category": "Lunch",
        "availableOn": "Wednesday",
        "datePublished": "06-11-2018",
        "url": "https://www.myprotein.com/thezone/recipe/easy-meal-prep-idea-asian-peanut-butter-sesame-chicken/"
    },
    {
        "id": 1005,
        "name": "Chia Berry Juice",
        "imageName": "https://cdn2.stylecraze.com/wp-content/uploads/2014/07/Chia-Berry-Juice.jpg.webp",
        "description": "Beetroot is one of the healthiest vegetables and loaded with nutrients. Beetroot juice contains nitrate, which improves exercise performance. Nitrate is converted into nitric oxide (NO) in the body. Nitric oxide helps in vasodilation (increases the length and width of blood vessels), improves blood flow, and increases muscle contraction. This sweet veggie provides energy and tastes great when mixed with lime juice and Himalayan salt.",
        "ingredients": "1 beetroot, peeled and chopped, 1 tablespoon lime juice, A pinch of pink Himalayan salt",
        "directions": "Blend the beetroot and transfer it to a glass. Add lime juice and pink Himalayan salt to it. Stir well and drink.",
        "category": "Breakfast",
        "availableOn": "Tuesday",
        "datePublished": "03-05-2022",
        "url": "https://www.stylecraze.com/articles/best-natural-energy-drinks-for-gym/"
    },
    {
        "id": 1006,
        "name": "Green Tea",
        "imageName": "https://cdn2.stylecraze.com/wp-content/uploads/2014/07/Green-Tea-3.jpg.webp",
        "description": "Green tea is loaded with antioxidants and a small amount of caffeine. Having it about an hour before working out will provide energy and also prevent you from feeling tired and hungry.",
        "ingredients": "1 teaspoon green tea leaves, 1 cup water",
        "directions": "Pour a cup of water into a saucepan and let it come to a boil. Switch the burner off and let the water cool down for about 3 minutes. Add the green tea leaves and steep for 3 minutes. Strain the tea into a cup.",
        "category": "Breakfast",
        "availableOn": "Monday",
        "datePublished": "01-01-2013",
        "url": "https://www.stylecraze.com/articles/best-natural-energy-drinks-for-gym/"
    },
    {
        "id": 1007,
        "name": "PEANUT BUTTER JELLY MUFFINS",
        "imageName": "https://www.eatthis.com/wp-content/uploads/sites/4/media/images/ext/739180847/post-workout-PBJ-Muffins.jpg",
        "description": "Peanut butter and jelly may be a childhood stable, but with satiating peanut butter and simple sugar jelly, it deserves a spot in your post-workout recipe file. It's ingredients are easy to break down for energy and won't leave you rummaging through your cabinets. And did we mention these are muffins and they're both dairy and grain free?",
        "ingredients": "473.18 ml all-purpose flour, 7.39 ml salt ,14.79 ml baking powder, 236.59 ml milk, 2 large eggs, 157.80 ml sugar ,236.59 ml creamy peanut butter, 78.78 ml vegetable oil, 118.29 ml jam or 118.29 ml preserves, of your choice, 59.14 ml sugar",
        "directions": "Heat oven to 375 degrees F. Spray muffin pan with no-stick spray. Stir together flour, salt and baking powder in a large bowl. Add milk, eggs, 2/3 cup sugar, peanut butter and oil to bowl. Combine ingredients on low speed of electric mixer, just until moistened. Do not over beat batter between muffin cups. Sprinkle with the 1/4 cup sugar. Bake for 18-20 minutes. Remove from oven. Cool in pan 5 minutes.",
        "category": "Breakfast",
        "availableOn": "Wednesday",
        "datePublished": "03-09-2021",
        "url": "https://www.food.com/recipe/peanut-butter-and-jelly-muffins-404042?units=metric&scale=12"
    },
    {
        "id": 1008,
        "name": "BERRY YOGURT POPSICLES",
        "imageName": "https://www.eatthis.com/wp-content/uploads/sites/4/media/images/ext/894646509/post-workout-Berry-Parfait-Yogurt-Popsicles.jpg",
        "description": "With temperatures rising and people more active than ever in an effort to obtain their summer body goals, these yogurt popsicles couldn't be more clutch. Cool off, refuel, and keep at it.",
        "ingredients": "3 cups fresh or frozen fruit, roughly chopped if large: strawberries (about 1 1/2 pints), cherries, whole blueberries, raspberries, peaches, blackberries, plums—pick your favorite!, 2-4 tablespoons honey, maple syrup, or agave, divided, 1 teaspoon pure vanilla extract, 1 1/2 cups plain Greek yogurt, 1/4 cup milk (any kind dairy/non-dairy will do—I used skim) omit if using regular vs. Greek yogurt, 2/3 cup prepared granola",
        "directions": "In a small saucepan, combine the fruit and 2 tablespoons honey. Stir gently to combine. Turn the pan to medium-high heat, then bring the fruit to steady simmer. Let cook until the fruit is a thick and jammy consistency, about 8 to 10 minutes (some fruit may need longer). Stir often so that the fruit does not burn. Remove from heat, stir in the vanilla extract, then let cool to room temperature. In a small bowl or measuring cup, stir together the Greek yogurt, milk and 1 tablespoon of honey. Taste and add additional honey a little at a time until you reach your desired sweetness. Place the granola in a small bowl, then mix it with 1/4 cup of the prepared yogurt mixture. This coats the granola and will help it soften and freeze into the popsicles. Arrange a popsicle mold on your work surface. With a small spoon, place a generous dollop of yogurt into the bottom of each. Next, add a small scoop of granola, then a spoonful of the cooked fruit, lightly tapping the mold on the counter between layers to remove any air pockets. Continue layering the yogurt, granola, and fruit until the molds are filled. Tap the molds on the counter once more, then insert the popsicle stick. Freeze until solid, 6 hours or overnight. To unmold the yogurt popsicles, run the mold under hot water for a few seconds (the time needed will vary based upon the temperature of your freezer). Gently remove and enjoy!",
        "category": "Dinner",
        "availableOn": "Monday",
        "datePublished": "28-02-2014",
        "url": "https://www.wellplated.com/yogurt-popsicles/"
    },
    {
        "id": 1009,
        "name": "TOMATO TOAST W/ MACADAMIA RICOTTA, SHISO + BLACK LAVA SALT",
        "imageName": "https://images.squarespace-cdn.com/content/v1/51338111e4b021358bcbb0e1/1440263081906-GKTFHSOO5710IMWBKVSK/tomato+toast+w%2F+macadamia+ricotta%2C+shiso+%2B+black+lava+salt+%7C+dolly+and+oatmeal?format=1500w",
        "description": "Here’s a vegan take on a classic summer breakfast sandwich. Instead of mayo, a fluffy, rich mixture of nuts, garlic, miso paste, and nutritional yeast is spread on hearty whole-grain bread. Then slices of ripe tomatoes are layered on — we love to mix red and yellow heirlooms.",
        "ingredients": "macadamia ricotta: 1 cup soaked raw macadamia nuts, drained and rinsed, 1 1/2 tablespoons nutritional yeast, 2 teaspoons apple cider vinegar, 1 1/2 teaspoon fresh lemon juice, 2 teaspoons white mellow miso paste, 2 small cloves garlic, 8-10 tablespoons filtered water, 1/4 teaspoon fine grain sea salt. Tomato toasts: 6-8 slices whole grain gluten-free bread (or bread of choice), toasted, 1/2 pound tomatoes (see notes), sliced with 1/4 thickness, 1/2 cup macadamia ricotta, 1/4 cup julienned shiso, a few pinches black lava salt (or large grain sea salt)",
        "directions": "macadamia ricotta: drain and rinse the macadamia nuts and place in an upright high-speed blender with nutritional yeast, vinegar, lemon juice, miso, garlic, 8 tablespoons of water, and salt. blend on high for 1 minute, scraping down the sides of the blender and adding water a tablespoon at a time, until you reach a fluffy creamy consistency. taste and adjust salt, vinegar, or lemon as necessary. transfer ricotta to a bowl and cover with cling wrap; refrigerate until ready to use. Toasts: remove macadamia ricotta from the fridge and set aside, top toasted bread with macadamia ricotta, sliced tomatoes, julienned shiso, and a few pinches of black salt. cut the toast in half and serve.",
        "category": "Breakfast",
        "availableOn": "Thursday",
        "datePublished": "25-07-2015",
        "url": "http://www.dollyandoatmeal.com/blog/2015/8/tomato-toast-w-macadamia-ricotta-shiso-black-sea-salt"
    },
    {
        "id": 1010,
        "name": "HOMEMADE HAMBURGER HELPER",
        "imageName": "https://www.wellplated.com/wp-content/uploads/2020/09/Homemade-Hamburger-Helper.jpg",
        "description": "Lean ground beef cooked with noodles in a rich and creamy sauce, this one-pan meal cooks entirely in a single skillet, even the pasta!",
        "ingredients": "2 tablespoons extra virgin olive oil, 1 large yellow onion cut into 1/2-inch dice, 3 medium carrots scrubbed and cut into 1/4-inch dice, 1/2 teaspoon kosher salt, 1/4 teaspoon black pepper, 3 garlic cloves minced (about 1 tablespoon), 1 pound lean ground beef (I used 93% lean), 2 to 3 teaspoons hot sauce, 1 teaspoon Dijon mustard, 2 teaspoons smoked paprika, 1 14-ounce can reduced sodium beef broth, 2 cups water plus additional as needed, 8 ounces whole wheat elbow pasta, 1/2 cup plain nonfat Greek yogurt, 1 1/2 cups grated sharp cheddar cheese, 1/4 cup chopped chives divided (optional)",
        "directions": "Heat a Dutch oven or a large, deep 12-inch skillet with a sturdy bottom over medium-low heat. Add the oil onion, carrot, salt, and pepper. Let cook until the onion turns brown and soft, about 10 minutes (don't shortcut this step; it builds a lot of flavor). Add the garlic and let cook just until fragrant, about 30 seconds. Increase heat to medium-high and add the ground beef. With the back of a large spoon or a sturdy spatula, break the meat into small pieces. Continue to brown, stirring periodically, until the meat is browned and cooked through, about 6 minutes. Remove pan from the heat and carefully drain off any excess fat, leaving just a little bit in the pan to keep the meat moist (if you are using meat that is 93% lean, you likely will not need to drain it). Return the pan to the medium-high heat. Stir in the hot sauce, Dijon, and smoked paprika. Add the beef broth. Scrape up any browned bits stuck to the pan. Add the water and stir to combine. Bring the liquid to a boil over medium-high heat. Once the liquid is boiling, add the pasta and cook until al dente according to package instructions, stirring often and scraping a spoon along the bottom of the pan to keep it from sticking. If at any point the pasta becomes to dry, splash in a bit of water. Remove the pan from the heat and let cool 1 minute. Add the Greek yogurt and cheddar. Stir until the cheese is melted and the ingredients are well combined. Stir in half of the chives, then sprinkle the remaining chives on top. Enjoy hot.",
        "category": "Lunch",
        "availableOn": "Thursday",
        "datePublished": "09-04-2022",
        "url": "https://www.wellplated.com/homemade-hamburger-helper/"
    },
    {
        "id": 1011,
        "name": "HOMEMADE HAMBURGER HELPER",
        "imageName": "https://www.wellplated.com/wp-content/uploads/2020/09/Homemade-Hamburger-Helper.jpg",
        "description": "Lean ground beef cooked with noodles in a rich and creamy sauce, this one-pan meal cooks entirely in a single skillet, even the pasta!",
        "ingredients": "2 tablespoons extra virgin olive oil, 1 large yellow onion cut into 1/2-inch dice, 3 medium carrots scrubbed and cut into 1/4-inch dice, 1/2 teaspoon kosher salt, 1/4 teaspoon black pepper, 3 garlic cloves minced (about 1 tablespoon), 1 pound lean ground beef (I used 93% lean), 2 to 3 teaspoons hot sauce, 1 teaspoon Dijon mustard, 2 teaspoons smoked paprika, 1 14-ounce can reduced sodium beef broth, 2 cups water plus additional as needed, 8 ounces whole wheat elbow pasta, 1/2 cup plain nonfat Greek yogurt, 1 1/2 cups grated sharp cheddar cheese, 1/4 cup chopped chives divided (optional)",
        "directions": "Heat a Dutch oven or a large, deep 12-inch skillet with a sturdy bottom over medium-low heat. Add the oil onion, carrot, salt, and pepper. Let cook until the onion turns brown and soft, about 10 minutes (don't shortcut this step; it builds a lot of flavor). Add the garlic and let cook just until fragrant, about 30 seconds. Increase heat to medium-high and add the ground beef. With the back of a large spoon or a sturdy spatula, break the meat into small pieces. Continue to brown, stirring periodically, until the meat is browned and cooked through, about 6 minutes. Remove pan from the heat and carefully drain off any excess fat, leaving just a little bit in the pan to keep the meat moist (if you are using meat that is 93% lean, you likely will not need to drain it). Return the pan to the medium-high heat. Stir in the hot sauce, Dijon, and smoked paprika. Add the beef broth. Scrape up any browned bits stuck to the pan. Add the water and stir to combine. Bring the liquid to a boil over medium-high heat. Once the liquid is boiling, add the pasta and cook until al dente according to package instructions, stirring often and scraping a spoon along the bottom of the pan to keep it from sticking. If at any point the pasta becomes to dry, splash in a bit of water. Remove the pan from the heat and let cool 1 minute. Add the Greek yogurt and cheddar. Stir until the cheese is melted and the ingredients are well combined. Stir in half of the chives, then sprinkle the remaining chives on top. Enjoy hot.",
        "category": "Dinner",
        "availableOn": "Tuesday",
        "datePublished": "09-04-2022",
        "url": "https://www.wellplated.com/homemade-hamburger-helper/"
    },
    {
        "id": 1012,
        "name": "Asian Peanut Butter Sesame Chicken",
        "imageName": "https://blogscdn.thehut.net/app/uploads/sites/478/2021/03/Peanut-butter-chicken-1800-1200_1653894289.jpg",
        "description": "Try switching up your chicken meal prep for our Asian-inspired peanut butter chicken, at only 498kcal and a huge 40g protein per meal.",
        "ingredients": "For the chicken: 5 tbsp. Peanut Butter, 50ml orange juice, 3 tbsp. Sugar-Free Syrup (Maple Flavour), 3 tbsp. soy sauce, 1 thumb ginger (grated), 3 chicken breasts. For the salad: 2 cucumbers (spiralised or thinly sliced), 2 carrots (spiralised or thinly sliced). Salad dressing: 2 tbsp. Sugar-Free Syrup (Maple Flavour) or Maple Syrup, 4 tbsp. soy sauce, 2 tbsp. sesame oil (if you don’t have this, substitute for your preferred oil or go without to reduce fat content). Serve with: 30g (dry weight) brown/basmati rice per meal",
        "directions": "Preheat the oven to 200°C or 180°C for fan-assisted. Whisk peanut butter, 100ml hot water and orange juice together until smooth then add the syrup, soy sauce and ginger. Set aside. Season and sear the chicken breasts by frying on a high heat using a non-stick pan for 3 minutes on each side, then transfer to a casserole dish and thoroughly coat the chicken with the peanut butter sauce. Bake for 20 minutes. Whilst waiting, make the salad dressing by whisking the syrup, soy, sesame oil and seeds together, then combine with the spiralised cucumber and carrots. Once the chicken is cooked, place into meal prep boxes and serve with the salad and brown rice. Three days lunch prep sorted.",
        "category": "Dinner",
        "availableOn": "Wednesday",
        "datePublished": "06-11-2018",
        "url": "https://www.myprotein.com/thezone/recipe/easy-meal-prep-idea-asian-peanut-butter-sesame-chicken/"
    },
    {
        "id": 1013,
        "name": "CREAMY CHICKEN NOODLE SOUP",
        "imageName": "https://www.wellplated.com/wp-content/uploads/2015/01/Easy-Healthy-Creamy-Chicken-Noodle-Soup.jpg",
        "description": "A soup made from chicken, simmered in water, usually with various other ingredients. The classic chicken soup consists of a clear chicken broth, often with pieces of chicken or vegetables; common additions are pasta, noodles, dumplings, or grains such as rice and barley.",
        "ingredients": "Chicken, Egg Noodles, Mirepoix, Chicken Broth, Flour + Evaporated Milk, Spices",
        "directions": "Sauté the carrots, celery, and onion. Add the garlic. Stir in the flour. Add the broth, then bring to a boil. Let simmer for 10 minutes. Stir in the chicken, noodles, and remaining ingredients. Cook for 10 minutes. Add desired toppings and ENJOY!",
        "category": "Dinner",
        "availableOn": "Thursday",
        "datePublished": "09-04-2022",
        "url": "https://www.wellplated.com/creamy-chicken-noodle-soup/"
    },
    {
        "id": 1014,
        "name": "CLASSIC STUFFED PEPPERS",
        "imageName": "https://hips.hearstapps.com/hmg-prod/images/delish-classic-stuffed-peppers-vertical-1538066317.jpg?crop=1xw:1xh;center,top&resize=480:*",
        "description": "Bell peppers are large enough to hold a lot, strong enough to keep their shape in the oven, and mild enough in flavor to go with just about anything. In other words, they’re the perfect vessel to hold a variety of different ingredients and fillings.",
        "ingredients": "1/2 c. uncooked rice, 2 tbsp. extra-virgin olive oil, plus more for drizzling, 1 medium onion, chopped, 2 tbsp. tomato paste, 3 cloves garlic, minced, 1 lb. ground beef, 1 (14.5-oz.) can diced tomatoes, 1 1/2 tsp. dried oregano, Kosher salt, Freshly ground black pepper, 6 bell peppers, tops and cores removed, 1 c. shredded Monterey jack, Freshly chopped parsley, for garnish",
        "directions": "Preheat oven to 400°. In a small saucepan, prepare rice according to package instructions. In a large skillet over medium heat, heat oil. Cook onion until soft, about 5 minutes. Stir in tomato paste and garlic and cook until fragrant, about 1 minute more. Add ground beef and cook, breaking up meat with a wooden spoon, until no longer pink, 6 minutes. Drain fat. Return beef mixture to skillet, then stir in cooked rice and diced tomatoes. Season with oregano, salt, and pepper. Let simmer until liquid has reduced slightly, about 5 minutes. Place peppers cut side-up in a 9 inch by 13 inch baking dish and drizzle with oil. Spoon beef mixture into each pepper and top with Monterey jack, then cover baking dish with foil. Bake until peppers are tender, about 35 minutes. Uncover and bake until cheese is bubbly, 10 minutes more. Garnish with parsley before serving.",
        "category": "Dinner",
        "availableOn": "Friday",
        "datePublished": "09-04-2022",
        "url": "https://www.delish.com/cooking/recipe-ideas/a23014857/classic-stuffed-peppers-recipe/"
    },
    {
        "id": 1015,
        "name": "PEANUT BUTTER JELLY MUFFINS",
        "imageName": "https://www.eatthis.com/wp-content/uploads/sites/4/media/images/ext/739180847/post-workout-PBJ-Muffins.jpg",
        "description": "Peanut butter and jelly may be a childhood stable, but with satiating peanut butter and simple sugar jelly, it deserves a spot in your post-workout recipe file. It's ingredients are easy to break down for energy and won't leave you rummaging through your cabinets. And did we mention these are muffins and they're both dairy and grain free?",
        "ingredients": "473.18 ml all-purpose flour, 7.39 ml salt ,14.79 ml baking powder, 236.59 ml milk, 2 large eggs, 157.80 ml sugar ,236.59 ml creamy peanut butter, 78.78 ml vegetable oil, 118.29 ml jam or 118.29 ml preserves, of your choice, 59.14 ml sugar",
        "directions": "Heat oven to 375 degrees F. Spray muffin pan with no-stick spray. Stir together flour, salt and baking powder in a large bowl. Add milk, eggs, 2/3 cup sugar, peanut butter and oil to bowl. Combine ingredients on low speed of electric mixer, just until moistened. Do not over beat batter between muffin cups. Sprinkle with the 1/4 cup sugar. Bake for 18-20 minutes. Remove from oven. Cool in pan 5 minutes.",
        "category": "Breakfast",
        "availableOn": "Wednesday",
        "datePublished": "03-09-2021",
        "url": "https://www.food.com/recipe/peanut-butter-and-jelly-muffins-404042?units=metric&scale=12"
    },
    {
        "id": 1016,
        "name": "Buffalo Chicken Pasta Salad",
        "imageName": "https://blogscdn.thehut.net/app/uploads/sites/478/2021/03/Buffalo-chicken-1800x1200-minopt_blog_1573554985_1653894195.jpg",
        "description": "This high-protein buffalo chicken pasta salad will change your chicken meal prep game forever. Trust us – buffalo sauce makes everything better.",
        "ingredients": "For the pasta: 160g cooked pasta, 3 breasts cooked chicken, 2 stalks celery, Handful cherry tomatoes, 1 yellow pepper, 2 tbsp. reduced-fat ranch dressing, Large handful mixed leaves. For the buffalo sauce: 175ml peri-peri sauce, ½ tsp. garlic powder, 4 tbsp. reduced-fat butter or margarine, Pinch salt",
        "directions": "Place a saucepan over a medium heat and add the peri-peri sauce and garlic powder. Cook for 2 minutes, then add butter and salt and cook for a further 5 minutes, stirring occasionally. Remove from the heat and allow to cool for a few minutes. Chop celery, tomatoes and pepper into bite-size pieces, and then shred the chicken using two forks. Place into a large mixing bowl with the cooked pasta. Pour over buffalo sauce and toss it through the pasta salad. Divide amongst 3 meal-prep containers and drizzle a little ranch dressing over each, and serve with a handful of mixed leaves or your favourite side salad. Refrigerate for up to 3 days and enjoy hot or cold.",
        "category": "Lunch",
        "availableOn": "Friday",
        "datePublished": "17-01-2021",
        "url": "https://www.myprotein.com/thezone/recipe/buffalo-chicken-3-day-chicken-meal-prep/"
    }
]
